// Задача 2. Дан непустой массив A, содержащий n вещественных чисел.
// Найти количество его локальных минимумов.
// Локальный минимум – элемент, который <= левого и правого соседей.
#include<stdlib.h>
size_t task2(double A[], size_t n)
{
    size_t count = 0;
    size_t i;
    if (n == 1)
        return 1; 

    for (i = 0; i < n; ++i)
    {
        if ((i == 0 && A[i] <= A[i + 1]) || 
            (i == n - 1 && A[i] <= A[i - 1]) || 
            (i > 0 && i < n - 1 && A[i] <= A[i - 1] && A[i] <= A[i + 1])) 
        {
            count++;
        }
    }

    return count;
}
